# Плохой import * (импорт звёздочка)
# Ещё один вариант импорта: from имя_модуля import *
# Подобная запись импортирует из модуля все глобальные объекты за исключением
# тех, чьи имена начинаются с символа подчёркивания. Рассмотрим на примере.
# ● Файл super_module.py
# Переменная __all__

from random import randint

__all__ = ['func', '_secret']  # использовать только, если нужно импортировать конкретные модули

SIZE = 100
_secret = 'qwerty'
__top_secret = '1q2w3e4r5t6y'


def func(a: int, b: int) -> str:
    z = f'В диапазоне от {a} до {b} получили {randint(a, b)}'
    return z


result = func(1, 6)
# В модуле есть следующие объекты:
# ● глобальная функция randint
# ● глобальная константа SIZE
# ● глобальная защищенная переменная _secret
# ● глобальная приватная переменная __top_secret
# ● глобальная функция func
# ● локальные параметры функции a и b
# ● локальная переменная функции z
# ● глобальная переменная result
# 🔥 Внимание! Если название объекта (переменной, функции и т.п.)
# начинается с символа подчёркивания, объект становится защищённым. Если
# имя начинается с двух подчёркиваний, объект становится приватным. Объекты
# без подчёркивания в начале имени — публичные. Подробнее разберём на
# лекциях по ООП.
