# Запуск скрипта с параметрами
# Python позволяет запускать скрипты с параметрами. Для этого после имени
# исполняемого файла указываются ключи и/или значения через пробел.
# Например создадим файл script.py со следующим кодом.
print('start')
print('stop')
# Открываем консоль операционный системы и вводим команду на запуск.
# python3 script.py
# 🔥 Важно! Для UNIX ОС используем команду python3. В Windows — python.
# 🔥 Важно! Не перепутайте консоль ОС и терминал интерпретатора Python.
# Терминал выдаёт в начале строки приветствие на ввод — тройную стрелку >>>.
# Скрипт вывел текст в консоль и завершил работу. Научим его принимать значения
# из командной строки.
