# 2. Простой декоратор без параметров
# Дополнительные переменные в декораторе
# Мы уже замыкали внутри функции список для хранения переданных имён.
# Декораторы открывают большие возможности по модификации основной функции.
# Рассмотрим пример простого кэширующего декоратора.
from typing import Callable


def cache(func: Callable):
    _cache_dict = {}

    def wrapper(*args):
        if args not in _cache_dict:
            _cache_dict[args] = func(*args)
        return _cache_dict[args]

    return wrapper


@cache
def factorial(n: int) -> int:
    print(f'Вычисляю факториал для числа {n}')
    f = 1
    for i in range(2, n + 1):
        f *= i
    return f


print(f'{factorial(10) = }')
print(f'{factorial(15) = }')
print(f'{factorial(10) = }')
print(f'{factorial(20) = }')
print(f'{factorial(10) = }')
print(f'{factorial(20) = }')
# Внутри декоратора cache создали пустой словарь _cache_dict. При каждом вызове
# функции factorial внутри обёртки wrapper происходит проверка. Если переданное
# для нахождения факториало число не является ключём словаря, создаём
# соответствующий ключ и в качестве значения присваиваем ему результат
# вычисления факториала. Когда в словаре есть ключ, декорируемая функция не
# вызывается, а ответ сразу возвращается из словаря.
# 🔥 Важно! Мы специально исключили параметр **kwargs из функции
# wrapper, т.к. это словарь ключевых аргументов. Попытка использования в
# 13
# качестве ключа словаря _cache_dict другого словаря kwargs приведёт к ошибке.
# Ключом может выступать только неизменяемые объекты.
